# Summary and Aggregation Functions 汇总和聚合函数

## 1. Summary Functions  概要函数
- Pandas has many simple "summary functions" (well, this is not an official name) that help you to restructure your data in a very useful way and displays useful information about the data.  Pandas 有许多简单的"汇总函数"（嗯，这并不是官方名称），它们能以非常实用的方式帮助你重新组织数据，并显示有关数据的有用信息。

In [2]:
import pandas as pd
import numpy as np

exam_scores = pd.read_csv('data/exam_scores.csv')

### a. info()

In [3]:
exam_scores.info()  # Displays information about the DataFrame, such as number of entries, column names, data types, and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### b. describe()

In [4]:
exam_scores.describe()

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [5]:
# If we want to get a summary of categorical columns separately, then we can use the parameter 'include'. 如果我们想分别获取分类列的摘要，可以使用参数'include'。
exam_scores.describe(include='object')  # Displays summary statistics for categorical columns.

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,502,294,226,649,654

In [6]:
# Also, we can get a summary of numerical and categorical columns together using the same parameter 'include'.  我们也可以使用相同的参数'include'，一起获取数值和分类列的摘要。
exam_scores.describe(include='all')  # Displays summary statistics for both numerical and categorical columns.

# count - 特定列中非空条目的数量。例如，性别列有 1000 个非空条目。
# unique - 列中唯一值的数量。仅适用于分类列。例如，性别列有 2 个唯一值——男性和女性。
# top - 这也仅适用于分类列。它告诉我们哪个类别出现的次数最多。例如，在性别列中，'female' 出现的次数最多。
# freq - 这同样仅适用于分类列。它告诉你该列中最高频类别的出现次数。例如，在性别列中，'female' 出现了 502 次。
# mean - 数值列的均值。例如，数学平均分是 67.128。
# std - 数值列的标准差。它告诉你数据的波动情况。
# min - 数值列中的最小值。
# 25% - 数值列中的 25 分位数（或第 1 四分位数）值。
# 50% - 数值列中的 50 分位数（或第 2 四分位数或中位数）值。
# 75% - 数值列中的 75 分位数（或第 3 四分位数）值。
# max - 数值列中的最大值。
# NaN 值表示对于特定列，某个汇总值不可用。

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

In [7]:
# We can also use describe() method on a particular column/series:  我们也可以对特定列/序列使用 describe()方法：
exam_scores['math score'].describe()  # Displays summary statistics for the 'math score' column.

count    1000.000000
mean       67.128000
std        14.815367
min        15.000000
25%        58.000000
50%        67.000000
75%        78.000000
max       100.000000
Name: math score, dtype: float64

In [8]:
# 如果列名不包含空格还可以用.访问
exam_scores.gender.describe()

count       1000
unique         2
top       female
freq         502
Name: gender, dtype: object

## 2. Aggregation Functions  聚合函数

In [10]:
# We can also use the individual methods like mean(), median(), unique() to get this information on a DataFrame or a series.
# 我们还可以使用 mean()、median()、unique()等单个方法来获取 DataFrame 或序列上的这些信息。
exam_scores.gender.unique()

array(['male', 'female'], dtype=object)

In [11]:
# To see all the unique values and the number of times they are occurring in the dataset, we have a method called value_counts():
# 要查看数据集中所有唯一值及其出现的次数，我们有一个名为 value_counts()的方法：
exam_scores.gender.value_counts()  # Displays the count of unique values

gender
female    502
male      498
Name: count, dtype: int64

## 3. Exercise 练习

In [13]:
sma_data = pd.read_csv('data/Standard_Metropolitan_Areas_Data-data.csv')
sma_data.head()

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
0,1384,78.1,12.3,25627,69678,50.1,4083.9,72100,1,75.55
1,3719,43.9,9.4,13326,43292,53.9,3305.9,54542,2,56.03
2,3553,37.4,10.7,9724,33731,50.6,2066.3,33216,1,41.32
3,3916,29.9,8.8,6402,24167,52.2,1966.7,32906,2,67.38
4,2480,31.5,10.5,8502,16751,66.1,1514.5,26573,4,80.19

In [14]:
sma_data.mean()

land_area         2615.727273
percent_city        42.518182
percent_senior       9.781818
physicians        1828.333333
hospital_beds     6345.868687
graduates           54.463636
work_force         449.366667
income            6762.505051
region               2.494949
crime_rate          55.643030
dtype: float64

In [15]:
sma_data.region.unique()

array([1, 2, 4, 3])

In [16]:
sma_data.describe(include='all')

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000
mean,2615.727273,42.518182,9.781818,1828.333333,6345.868687,54.463636,449.366667,6762.505051,2.494949,55.643030
std,3045.826210,17.348277,2.524547,3192.199763,9136.202716,7.773286,610.990885,10393.349660,1.013921,13.470943
min,47.000000,13.400000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,1.000000,23.320000
25%,1408.000000,30.100000,8.350000,459.000000,2390.000000,50.250000,150.300000,2003.000000,2.000000,46.115000
50%,1951.000000,39.500000,9.700000,774.000000,3472.000000,54.000000,257.200000,3510.000000,3.000000,56.060000
75%,2890.500000,52.600000,10.750000,1911.500000,6386.500000,58.300000,436.500000,6283.500000,3.000000,63.860000
max,27293.000000,100.000000,21.800000,25627.000000,69678.000000,72.800000,4083.900000,72100.000000,4.000000,85.620000

In [17]:
sample_data1 = sma_data[sma_data.region == 3]
sample_data1.describe(include='all')  # Displays summary statistics for the sample data where region is 3.

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
count,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.000000,36.0,36.000000
mean,2485.972222,46.172222,9.283333,1313.722222,4962.777778,51.002778,343.797222,4806.861111,3.0,58.265556
std,1653.813800,19.101019,3.458199,1459.654903,3879.692625,7.328164,354.312228,5452.647656,0.0,10.155822
min,654.000000,14.500000,3.900000,140.000000,481.000000,30.300000,66.900000,769.000000,3.0,36.360000
25%,1517.000000,31.350000,7.600000,509.750000,2483.500000,46.950000,146.200000,1940.750000,3.0,52.447500
50%,2018.000000,47.000000,8.850000,767.000000,3876.000000,50.950000,230.550000,2976.500000,3.0,58.725000
75%,2911.000000,59.725000,9.975000,1583.500000,5811.750000,55.175000,366.950000,4829.500000,3.0,64.922500
max,8360.000000,90.700000,21.800000,7340.000000,16941.000000,70.700000,1541.900000,25663.000000,3.0,76.350000

In [18]:
sma_data.region.value_counts()  # Displays the count of unique values in the 'region' column.

region
3    36
2    25
1    21
4    17
Name: count, dtype: int64